#include <stdio.h>

/*
 *  Проверка на покажувачи
 *
 */

int main()
{
    char c = 'A';               // иницијализација на некој карактер
    printf("c=%c\n", c);        // печатење на карактерот
    printf("&c=%p\n", &c);      // печатење на адресата на карактерот

    char *cp = &c;              // иницијализација на покажувач до адресата на карактерот
    printf("cp=&c=%p\n", cp);   // печатење на вредноста на покажувачот (адресата на карактерот)
    printf("*cp=%c\n", *cp);    // дереференцирање на покажувачот (ја печати вредноста која се наоѓа на адресата)
    printf("&cp=%p\n", &cp);    // адресата на самиот покажувач

    char *cp2 = cp;             // иницијализација на втор покажувач
    printf("cp2=&c=%p\n", cp2); // печатење на вредноста на вториот покажувач (иста како првиот)
    printf("*cp2=%c\n", *cp);   // дереференцирање на покажувачот (ја печати вредноста која се наоѓа на адресата)
    printf("&cp2=%p\n", &cp2);  // адресата на самиот покажувач

    *cp2 = 'D';                 // менување на вредноста на покажувачот
    printf("c=%c, *cp=%c, *cp2=%c\n\n\n\n", c, *cp, *cp2);

    return 0;
}
