#include <stdio.h>

/*
 *  Функцијата треба да провери дали некој знак од првиот стринг
 *  се наоѓа во вториот, и ако се наоѓа да го отстрани.
 *
 */


int proverka(char *s1, char *s2);

int main()
{
    char s1[30] = "abcdefghij";
    char s2[30] = "wxzaubfghij";

    int povtoruvanja = proverka(s1, s2);

    printf("\n\n\nIma %d povtoruvanja i novodobieniot string e: %s\n\n\n\n", povtoruvanja, s1);

    return 0;
}

int proverka(char *s1, char *s2)
{
    int pos1, pos2, count = 0; // иницијализација на двата стринга и бројачот

    for(pos1 = 0; *(s1 + pos1) != '\0'; pos1++)     // итерира сѐ додека не стигне до \0 (null terminator) на првиот стринг
    {
        for(pos2 = 0; *(s2 + pos2) != '\0'; pos2++) // итерира сѐ додека не стигне до \0 (null terminator) на вториот стринг
        {
            if(*(s1 + pos1) == *(s2 + pos2))        // ако најде знакот од првиот да е ист со некој од вториот
            {
                int p;                                  // постави нова променлива за исфрлање на знакот
                for(p = pos1; *(s1 + p) != '\0'; p++)   // почни од најдениот знак кој па се до крај (\0)
                    *(s1 + p) = *(s1 + p + 1);i         // додади го следниот знак на место на претходниот
                count++;            // зголеми го бројачот на секој пронајден знак
                pos1--;             // намали ја позицијата бидејќи позициите на сите
                                    // следни знаци се поместени наназад
                break;      // излези од вотриот стринг и продолжи од истата позиција на првиот
            }
        }
    }
    return count;
}
